[
  {
      "grouping":"Personal Skills",
      "skills":[ "I believe that in my roles to date I have developed and demonstrated significant skills in project management, team management, client facing and commercial skills, flexible working, rapid learning, teamwork, time management and translational expertise."]
  },{
      "grouping":"Technical Skills",
      "skills":[  "Process development and optimization of LNP mRNA",
                  "lead process development and analytical development for a completely new modality.",
                  "Provide technical and strategic leadership for CMC development.",
                  "Proven high problem-solving capability for technical challenges",
                  "15+ years for nanomedicine and formulation development",
                  "Lipid nanoparticle for gene delivery:design, engineering and characterization.",
                  "Targeted LNP and liposome design, development and optimization. ",
                  "Develop novel strategies for the efficient loading of cargos into lipid nanoparticles, including DNA, RNA, protein and small molecules.",
                  "Preclinical development and optimization of novel nanoscaled modalities in cells and preclinical animal models ",
                  "CAR-T cell Therapy", "Discovery and engineering of novel antibody for CAR-T cell.",
                  "Vector design for CAR-T cell transduction, including transmembrane domain and signalling.",
                  "CAR-T cell characterization, e.g. antibody staining by FACs and cell-cell interaction ",
                  "Protein engineering",
                  "Protein purification and characterization.",
                  "Antibody humanization.",
                  "Protein expression vector design.",
                  "Surface protein expression, e.g. GPCR",
                  "Applied 3D imaging, single molecule imaging, quantitative imaging using fluorescent microscopy and confocal microscopy"
                  ]
  }
  
]


